<a href="https://colab.research.google.com/github/Ahbin-Park/beluga/blob/Python/Codeit_%EB%8D%B0%EC%9D%B4%ED%84%B0%EC%82%AC%EC%9D%B4%EC%96%B8%EC%8A%A4_Topic.2_DataFrame_20210611.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas와 DataFrame 생성

In [7]:
import pandas as pd

In [8]:
two_dimensional_list = [['dongwuk', 50, 86], ['sineui', 89, 31], ['yoonsoo', 88, 75]]

In [14]:
my_df = pd.DataFrame(two_dimensional_list, columns = ['name', 'english_score', 'math_score'], index=['a','b','c'])
my_df

      name  english_score  math_score
a  dongwuk             50          86
b   sineui             89          31
c  yoonsoo             88          75

In [15]:
type(my_df)

pandas.core.frame.DataFrame

- DF 내에서 여러가지 자료형을 가질 수 있음. 단, 같은 컬럼 내에서는 같은 자료 형.

In [17]:
#각 컬럼들의 데이터 타입도 조회
my_df.dtypes

name             object
english_score     int64
math_score        int64
dtype: object

### DataFrame을 만드는 다양한 방법
- From list of lists, array of arrays, list of series
- From dict of lists, dict of arrays, dict of series 
- From list of dicts (사전이 담긴 리스트)

**Series 관련 : https://nittaku.tistory.com/110

In [20]:
# From list of lists, array of arrays, list of series
import numpy as np
import pandas as pd

two_dimensional_list = [['dongwook', 50, 86], ['sineui', 89, 31], ['ikjoong', 68, 91], ['yoonsoo', 88, 75]]  #lists
two_dimensional_array = np.array(two_dimensional_list) #array로 변환하여 만들기
list_of_series = [
    pd.Series(['dongwook', 50, 86]), 
    pd.Series(['sineui', 89, 31]), 
    pd.Series(['ikjoong', 68, 91]), 
    pd.Series(['yoonsoo', 88, 75])
] #시리즈 형태의 것들을 변환

# 아래 셋은 모두 동일합니다
df1 = pd.DataFrame(two_dimensional_list)
df2 = pd.DataFrame(two_dimensional_array)
df3 = pd.DataFrame(list_of_series)

print(df1)
print(df2)
print(df)

          0   1   2
0  dongwook  50  86
1    sineui  89  31
2   ikjoong  68  91
3   yoonsoo  88  75
          0   1   2
0  dongwook  50  86
1    sineui  89  31
2   ikjoong  68  91
3   yoonsoo  88  75
          0   1   2
0  dongwook  50  86
1    sineui  89  31
2   ikjoong  68  91
3   yoonsoo  88  75

In [21]:
 #From dict of lists, dict of arrays, dict of series
## 사전의 key로는 column 이름을 쓰고, 그 column에 해당하는 리스트, numpy array, 혹은 pandas Series를 사전의 value로 넣어주면 됩니다.

names = ['dongwook', 'sineui', 'ikjoong', 'yoonsoo']
english_scores = [50, 89, 68, 88]
math_scores = [86, 31, 91, 75]

dict1 = {
    'name' : names,
    'english_score' : english_scores,
    'math_score' : math_scores
}

dict2 = {
    'name' : np.array(names),
    'english_score' : np.array(english_scores),
    'math_score' : np.array(math_scores)
}

dict3 = {
    'name' : pd.Series(names),
    'english_score' : pd.Series(english_scores),
    'math_score' : pd.Series(math_scores)
}

#데이터프레임으로 변환
df1 = pd.DataFrame(dict1)
df2 = pd.DataFrame(dict2)
df3 = pd.DataFrame(dict3)

print(df1)
print(df2)
print(df3)

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75
       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75
       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75

In [22]:
#From list of dicts (사전이 담긴 리스트)

my_list = [
    {'name': 'dongwook', 'english_score': 50, 'math_score': 86},
    {'name': 'sineui', 'english_score': 89, 'math_score': 31},
    {'name': 'ikjoong', 'english_score': 68, 'math_score': 91},
    {'name': 'yoonsoo', 'english_score': 88, 'math_score': 75}
]

df = pd.DataFrame(my_list)
df

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75

In [25]:
# 실습 과제 
lists = [
        ['Taylor Swift',	'December 13, 1989',	'Singer-songwriter'],
        ['Aaron Sorkin',	'June 9, 1961',	'Screenwriter'],
        ['Harry Potter',	'July 31, 1980',	'Wizard'],
        ['Ji-Sung Park',	'February 25, 1981',	'Footballer']
        ]
df = pd.DataFrame(lists, columns = ['name', 'birthday','occupation'])
df

           name           birthday         occupation
0  Taylor Swift  December 13, 1989  Singer-songwriter
1  Aaron Sorkin       June 9, 1961       Screenwriter
2  Harry Potter      July 31, 1980             Wizard
3  Ji-Sung Park  February 25, 1981         Footballer

###Datatype

- int64	정수
- float64	소수
- object	텍스트
- bool	불린(참과 거짓)
- datetime64	날짜와 시간
- category	카테고리

### Pandas 로 데이터 읽어들이기

In [4]:
import pandas as pd
iphone_df = pd.read_csv('iphone.csv', index_col = 0) # 파일 위치 폴더 경로 작성('~/~'), 0 해당 column을 index로 설정하기 (혹은 열 이름을 직접 지정해도됨)
#iphone_df = pd.read_csv('iphone.csv', index_col = 'Draw Date')

iphone_df

                      출시일  디스플레이  메모리     출시 버전 Face ID
iPhone 7       2016-09-16    4.7  2GB  iOS 10.0      No
iPhone 7 Plus  2016-09-16    5.5  3GB  iOS 10.0      No
iPhone 8       2017-09-22    4.7  2GB  iOS 11.0      No
iPhone 8 Plus  2017-09-22    5.5  3GB  iOS 11.0      No
iPhone X       2017-11-03    5.8  3GB  iOS 11.1     Yes
iPhone XS      2018-09-21    5.8  4GB  iOS 12.0     Yes
iPhone XS Max  2018-09-21    6.5  4GB  iOS 12.0     Yes

# DataFrame

* loc
++ 인덱스를 기준으로 행 데이터 추출 (특정 index number/name 기준)
```
df.loc[row, column]
```
* iloc
++ 행 번호를 기준으로 행 데이터 추출(데이터의 순서, 몇 번째 행)

In [6]:
import pandas as pd
iphone_df = pd.read_csv('iphone.csv', index_col = 0)

In [7]:
#인덱싱하기

iphone_df.loc['iPhone 8', '메모리'] #['행','열']

'2GB'

In [9]:
iphone_df.loc['iPhone X', :] # :의 의미: 처음부터 끝까지

출시일        2017-11-03
디스플레이             5.8
메모리               3GB
출시 버전        iOS 11.1
Face ID           Yes
Name: iPhone X, dtype: object

In [21]:
#위와 비교
print(iphone_df.loc['iPhone X']) #열 기준 조회!!
print(type(iphone_df.loc['iPhone X'])) #시리즈(판다스의 1차원 자료형)

출시일        2017-11-03
디스플레이             5.8
메모리               3GB
출시 버전        iOS 11.1
Face ID           Yes
Name: iPhone X, dtype: object
<class 'pandas.core.series.Series'>

In [13]:
iphone_df.loc[:,'출시일'] #모든 row[:]

iPhone 7         2016-09-16
iPhone 7 Plus    2016-09-16
iPhone 8         2017-09-22
iPhone 8 Plus    2017-09-22
iPhone X         2017-11-03
iPhone XS        2018-09-21
iPhone XS Max    2018-09-21
Name: 출시일, dtype: object

In [16]:
iphone_df['출시일']

iPhone 7         2016-09-16
iPhone 7 Plus    2016-09-16
iPhone 8         2017-09-22
iPhone 8 Plus    2017-09-22
iPhone X         2017-11-03
iPhone XS        2018-09-21
iPhone XS Max    2018-09-21
Name: 출시일, dtype: object

**2개 이상의 칼럼의 모든 행을 가져오고 싶을 때**
```
columns = [column1, column2]
df[columns]
df[[column1, column2]]
```

In [ ]:
#실습과제 (내가 푼 것 concat 활용)
import pandas as pd

samsong_df = pd.read_csv('data/samsong.csv')
hyundee_df = pd.read_csv('data/hyundee.csv')

df1= samsong_df.loc[:, ['요일', '문화생활비']]
df2= hyundee_df.loc[:, '문화생활비']

df = pd.concat([df1, df2], axis=1)
df.columns = ['day','samsong','hyundee']
df

In [23]:
#비교 
#1. 활요할 데이터 컬럼만 확인
samsong_df['요일']
samsong_df['문화생활비']
hyundee_df['문화생활비']

#2. 파이썬 사전 만들기
dict = {
    'day' : samsong_df['요일'],
    'samsong' : samsong_df['문화생활비'],
    'hyundee' : hyundee_df['문화생활비']
}

#3. 데이터 프레임 만들기
combined_df = pd.DataFrame(dict)
combined df